* rpd-simulation
This project is a library for basic discrete event simulation, heavily
inspired by simpy.
* Usage
See /examples
* todo
** DONE spatial simulations
   CLOCK: [2010-11-25 Thu 15:50]--[2010-11-25 Thu 18:09] =>  2:19
   have a 2d discrete system based on an array, not very fast at all.
   Turns out the array wasn't the slow part, it was cl-heap vs pileup
** DONE continuous spatial sim
   use an r-tree instead of an array
** add lisp-unit
** DONE split into multiple packages
   CLOCK: [2010-12-07 Tue 19:03]--[2010-12-07 Tue 20:25] =>  1:22
*** rpd-simulation-impl
*** rpd-simulation for user-facing stuff
** DONE clean up SDL example
   :CLOCK:
   CLOCK: [2010-12-08 Wed 18:57]--[2010-12-08 Wed 19:31] =>  0:34
   CLOCK: [2010-12-07 Tue 22:03]--[2010-12-07 Tue 23:39] =>  1:36
   :END:
** ecology example
   CLOCK: [2010-12-08 Wed 19:32]--[2010-12-08 Wed 21:57] =>  2:25

